LBH9527/ESLink-II/startup/startup_MK22F12810_v1.3.s
;; * ---------------------------------------------------------------------------------------
;; *  @file:    startup_MK22F12810.s
;; *  @purpose: CMSIS Cortex-M4 Core Device Startup File
;; *            MK22F12810
;; *  @version: 1.3
;; *  @date:    2014-5-6
;; * ---------------------------------------------------------------------------------------
;; *
;; * Copyright (c) 1997 - 2014 , Freescale Semiconductor, Inc.
;; * All rights reserved.
;; *
;; * Redistribution and use in source and binary forms, with or without modification,
;; * are permitted provided that the following conditions are met:
;; *
;; * o Redistributions of source code must retain the above copyright notice, this list
;; *   of conditions and the following disclaimer.
;; *
;; * o Redistributions in binary form must reproduce the above copyright notice, this
;; *   list of conditions and the following disclaimer in the documentation and/or
;; *   other materials provided with the distribution.
;; *
;; * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
;; *   contributors may be used to endorse or promote products derived from this
;; *   software without specific prior written permission.
;; *
;; * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
;; * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
;; * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
;; * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
;; * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
;; * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
;; * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
;; * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
;; * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
;; * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
;; *
;; *------- <<< Use Configuration Wizard in Context Menu >>> ------------------
;; *
;; *****************************************************************************/


;; <h> Stack Configuration
;;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
;; </h>

;Stack_Size      EQU     0x00000800

                ;AREA    STACK, NOINIT, READWRITE, ALIGN=3
;Stack_Mem       SPACE   Stack_Size
;__initial_sp


;; <h> Heap Configuration
;;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
;; </h>

;Heap_Size       EQU     0x00000000

                ;AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit


                ;PRESERVE8
                ;THUMB


;; Vector Table Mapped to Address 0 at Reset

                ;AREA    RESET, DATA, READONLY
                ;EXPORT  __Vectors
                ;EXPORT  __Vectors_End
                ;EXPORT  __Vectors_Size

;__Vectors       DCD     __initial_sp  ; Top of Stack
                ;DCD     Reset_Handler  ; Reset Handler
                ;DCD     NMI_Handler                         ;NMI Handler
                ;DCD     HardFault_Handler                   ;Hard Fault Handler
                ;DCD     MemManage_Handler                   ;MPU Fault Handler
                ;DCD     BusFault_Handler                    ;Bus Fault Handler
                ;DCD     UsageFault_Handler                  ;Usage Fault Handler
                ;DCD     0                                   ;Reserved
                ;DCD     0                                   ;Reserved
                ;DCD     0                                   ;Reserved
                ;DCD     0                                   ;Reserved
                ;DCD     SVC_Handler                         ;SVCall Handler
                ;DCD     DebugMon_Handler                    ;Debug Monitor Handler
                ;DCD     0                                   ;Reserved
                ;DCD     PendSV_Handler                      ;PendSV Handler
                ;DCD     SysTick_Handler                     ;SysTick Handler

                                                            ;;External Interrupts
                ;DCD     DMA0_IRQHandler                     ;DMA Channel 0 Transfer Complete
                ;DCD     DMA1_IRQHandler                     ;DMA Channel 1 Transfer Complete
                ;DCD     DMA2_IRQHandler                     ;DMA Channel 2 Transfer Complete
                ;DCD     DMA3_IRQHandler                     ;DMA Channel 3 Transfer Complete
                ;DCD     Reserved20_IRQHandler               ;Reserved interrupt 20
                ;DCD     Reserved21_IRQHandler               ;Reserved interrupt 21
                ;DCD     Reserved22_IRQHandler               ;Reserved interrupt 22
                ;DCD     Reserved23_IRQHandler               ;Reserved interrupt 23
                ;DCD     Reserved24_IRQHandler               ;Reserved interrupt 24
                ;DCD     Reserved25_IRQHandler               ;Reserved interrupt 25
                ;DCD     Reserved26_IRQHandler               ;Reserved interrupt 26
                ;DCD     Reserved27_IRQHandler               ;Reserved interrupt 27
                ;DCD     Reserved28_IRQHandler               ;Reserved interrupt 28
                ;DCD     Reserved29_IRQHandler               ;Reserved interrupt 29
                ;DCD     Reserved30_IRQHandler               ;Reserved interrupt 30
                ;DCD     Reserved31_IRQHandler               ;Reserved interrupt 31
                ;DCD     DMA_Error_IRQHandler                ;DMA Error Interrupt
                ;DCD     MCM_IRQHandler                      ;Normal Interrupt
                ;DCD     FTF_IRQHandler                      ;FTFA Command complete interrupt
                ;DCD     Read_Collision_IRQHandler           ;Read Collision Interrupt
                ;DCD     LVD_LVW_IRQHandler                  ;Low Voltage Detect, Low Voltage Warning
                ;DCD     LLW_IRQHandler                      ;Low Leakage Wakeup
                ;DCD     Watchdog_IRQHandler                 ;WDOG Interrupt
                ;DCD     Reserved39_IRQHandler               ;Reserved Interrupt 39
                ;DCD     I2C0_IRQHandler                     ;I2C0 interrupt
                ;DCD     I2C1_IRQHandler                     ;I2C1 interrupt
                ;DCD     SPI0_IRQHandler                     ;SPI0 Interrupt
                ;DCD     SPI1_IRQHandler                     ;SPI1 Interrupt
                ;DCD     I2S0_Tx_IRQHandler                  ;I2S0 transmit interrupt
                ;DCD     I2S0_Rx_IRQHandler                  ;I2S0 receive interrupt
                ;DCD     LPUART0_IRQHandler                  ;LPUART0 status/error interrupt
                ;DCD     UART0_RX_TX_IRQHandler              ;UART0 Receive/Transmit interrupt
                ;DCD     UART0_ERR_IRQHandler                ;UART0 Error interrupt
                ;DCD     UART1_RX_TX_IRQHandler              ;UART1 Receive/Transmit interrupt
                ;DCD     UART1_ERR_IRQHandler                ;UART1 Error interrupt
                ;DCD     UART2_RX_TX_IRQHandler              ;UART2 Receive/Transmit interrupt
                ;DCD     UART2_ERR_IRQHandler                ;UART2 Error interrupt
                ;DCD     Reserved53_IRQHandler               ;Reserved interrupt 53
                ;DCD     Reserved54_IRQHandler               ;Reserved interrupt 54
                ;DCD     ADC0_IRQHandler                     ;ADC0 interrupt
                ;DCD     CMP0_IRQHandler                     ;CMP0 interrupt
                ;DCD     CMP1_IRQHandler                     ;CMP1 interrupt
                ;DCD     FTM0_IRQHandler                     ;FTM0 fault, overflow and channels interrupt
                ;DCD     FTM1_IRQHandler                     ;FTM1 fault, overflow and channels interrupt
                ;DCD     FTM2_IRQHandler                     ;FTM2 fault, overflow and channels interrupt
                ;DCD     Reserved61_IRQHandler               ;Reserved interrupt 61
                ;DCD     RTC_IRQHandler                      ;RTC interrupt
                ;DCD     RTC_Seconds_IRQHandler              ;RTC seconds interrupt
                ;DCD     PIT0_IRQHandler                     ;PIT timer channel 0 interrupt
                ;DCD     PIT1_IRQHandler                     ;PIT timer channel 1 interrupt
                ;DCD     PIT2_IRQHandler                     ;PIT timer channel 2 interrupt
                ;DCD     PIT3_IRQHandler                     ;PIT timer channel 3 interrupt
                ;DCD     PDB0_IRQHandler                     ;PDB0 Interrupt
                ;DCD     USB0_IRQHandler                     ;USB0 interrupt
                ;DCD     Reserved70_IRQHandler               ;Reserved interrupt 70
                ;DCD     Reserved71_IRQHandler               ;Reserved interrupt 71
                ;DCD     DAC0_IRQHandler                     ;DAC0 interrupt
                ;DCD     MCG_IRQHandler                      ;MCG Interrupt
                ;DCD     LPTimer_IRQHandler                  ;LPTimer interrupt
                ;DCD     PORTA_IRQHandler                    ;Port A interrupt
                ;DCD     PORTB_IRQHandler                    ;Port B interrupt
                ;DCD     PORTC_IRQHandler                    ;Port C interrupt
                ;DCD     PORTD_IRQHandler                    ;Port D interrupt
                ;DCD     PORTE_IRQHandler                    ;Port E interrupt
                ;DCD     SWI_IRQHandler                      ;Software interrupt
                ;DCD     Reserved81_IRQHandler               ;Reserved interrupt 81
                ;DCD     Reserved82_IRQHandler               ;Reserved interrupt 82
                ;DCD     Reserved83_IRQHandler               ;Reserved interrupt 83
                ;DCD     Reserved84_IRQHandler               ;Reserved interrupt 84
                ;DCD     Reserved85_IRQHandler               ;Reserved interrupt 85
                ;DCD     Reserved86_IRQHandler               ;Reserved interrupt 86
                ;DCD     Reserved87_IRQHandler               ;Reserved interrupt 87
                ;DCD     Reserved88_IRQHandler               ;Reserved interrupt 88
                ;DCD     ADC1_IRQHandler                     ;ADC1 interrupt
                ;DCD     Reserved90_IRQHandler               ;Reserved Interrupt 90
                ;DCD     Reserved91_IRQHandler               ;Reserved Interrupt 91
                ;DCD     Reserved92_IRQHandler               ;Reserved Interrupt 92
                ;DCD     Reserved93_IRQHandler               ;Reserved Interrupt 93
                ;DCD     Reserved94_IRQHandler               ;Reserved Interrupt 94
                ;DCD     Reserved95_IRQHandler               ;Reserved Interrupt 95
                ;DCD     Reserved96_IRQHandler               ;Reserved Interrupt 96
                ;DCD     Reserved97_IRQHandler               ;Reserved Interrupt 97
                ;DCD     Reserved98_IRQHandler               ;Reserved Interrupt 98
                ;DCD     Reserved99_IRQHandler               ;Reserved Interrupt 99
                ;DCD     Reserved100_IRQHandler              ;Reserved Interrupt 100
                ;DCD     Reserved101_IRQHandler              ;Reserved Interrupt 101
                ;DCD     DefaultISR                          ;102
                ;DCD     DefaultISR                          ;103
                ;DCD     DefaultISR                          ;104
                ;DCD     DefaultISR                          ;105
                ;DCD     DefaultISR                          ;106
                ;DCD     DefaultISR                          ;107
                ;DCD     DefaultISR                          ;108
                ;DCD     DefaultISR                          ;109
                ;DCD     DefaultISR                          ;110
                ;DCD     DefaultISR                          ;111
                ;DCD     DefaultISR                          ;112
                ;DCD     DefaultISR                          ;113
                ;DCD     DefaultISR                          ;114
                ;DCD     DefaultISR                          ;115
                ;DCD     DefaultISR                          ;116
                ;DCD     DefaultISR                          ;117
                ;DCD     DefaultISR                          ;118
                ;DCD     DefaultISR                          ;119
                ;DCD     DefaultISR                          ;120
                ;DCD     DefaultISR                          ;121
                ;DCD     DefaultISR                          ;122
                ;DCD     DefaultISR                          ;123
                ;DCD     DefaultISR                          ;124
                ;DCD     DefaultISR                          ;125
                ;DCD     DefaultISR                          ;126
                ;DCD     DefaultISR                          ;127
                ;DCD     DefaultISR                          ;128
                ;DCD     DefaultISR                          ;129
                ;DCD     DefaultISR                          ;130
                ;DCD     DefaultISR                          ;131
                ;DCD     DefaultISR                          ;132
                ;DCD     DefaultISR                          ;133
                ;DCD     DefaultISR                          ;134
                ;DCD     DefaultISR                          ;135
                ;DCD     DefaultISR                          ;136
                ;DCD     DefaultISR                          ;137
                ;DCD     DefaultISR                          ;138
                ;DCD     DefaultISR                          ;139
                ;DCD     DefaultISR                          ;140
                ;DCD     DefaultISR                          ;141
                ;DCD     DefaultISR                          ;142
                ;DCD     DefaultISR                          ;143
                ;DCD     DefaultISR                          ;144
                ;DCD     DefaultISR                          ;145
                ;DCD     DefaultISR                          ;146
                ;DCD     DefaultISR                          ;147
                ;DCD     DefaultISR                          ;148
                ;DCD     DefaultISR                          ;149
                ;DCD     DefaultISR                          ;150
                ;DCD     DefaultISR                          ;151
                ;DCD     DefaultISR                          ;152
                ;DCD     DefaultISR                          ;153
                ;DCD     DefaultISR                          ;154
                ;DCD     DefaultISR                          ;155
                ;DCD     DefaultISR                          ;156
                ;DCD     DefaultISR                          ;157
                ;DCD     DefaultISR                          ;158
                ;DCD     DefaultISR                          ;159
                ;DCD     DefaultISR                          ;160
                ;DCD     DefaultISR                          ;161
                ;DCD     DefaultISR                          ;162
                ;DCD     DefaultISR                          ;163
                ;DCD     DefaultISR                          ;164
                ;DCD     DefaultISR                          ;165
                ;DCD     DefaultISR                          ;166
                ;DCD     DefaultISR                          ;167
                ;DCD     DefaultISR                          ;168
                ;DCD     DefaultISR                          ;169
                ;DCD     DefaultISR                          ;170
                ;DCD     DefaultISR                          ;171
                ;DCD     DefaultISR                          ;172
                ;DCD     DefaultISR                          ;173
                ;DCD     DefaultISR                          ;174
                ;DCD     DefaultISR                          ;175
                ;DCD     DefaultISR                          ;176
                ;DCD     DefaultISR                          ;177
                ;DCD     DefaultISR                          ;178
                ;DCD     DefaultISR                          ;179
                ;DCD     DefaultISR                          ;180
                ;DCD     DefaultISR                          ;181
                ;DCD     DefaultISR                          ;182
                ;DCD     DefaultISR                          ;183
                ;DCD     DefaultISR                          ;184
                ;DCD     DefaultISR                          ;185
                ;DCD     DefaultISR                          ;186
                ;DCD     DefaultISR                          ;187
                ;DCD     DefaultISR                          ;188
                ;DCD     DefaultISR                          ;189
                ;DCD     DefaultISR                          ;190
                ;DCD     DefaultISR                          ;191
                ;DCD     DefaultISR                          ;192
                ;DCD     DefaultISR                          ;193
                ;DCD     DefaultISR                          ;194
                ;DCD     DefaultISR                          ;195
                ;DCD     DefaultISR                          ;196
                ;DCD     DefaultISR                          ;197
                ;DCD     DefaultISR                          ;198
                ;DCD     DefaultISR                          ;199
                ;DCD     DefaultISR                          ;200
                ;DCD     DefaultISR                          ;201
                ;DCD     DefaultISR                          ;202
                ;DCD     DefaultISR                          ;203
                ;DCD     DefaultISR                          ;204
                ;DCD     DefaultISR                          ;205
                ;DCD     DefaultISR                          ;206
                ;DCD     DefaultISR                          ;207
                ;DCD     DefaultISR                          ;208
                ;DCD     DefaultISR                          ;209
                ;DCD     DefaultISR                          ;210
                ;DCD     DefaultISR                          ;211
                ;DCD     DefaultISR                          ;212
                ;DCD     DefaultISR                          ;213
                ;DCD     DefaultISR                          ;214
                ;DCD     DefaultISR                          ;215
                ;DCD     DefaultISR                          ;216
                ;DCD     DefaultISR                          ;217
                ;DCD     DefaultISR                          ;218
                ;DCD     DefaultISR                          ;219
                ;DCD     DefaultISR                          ;220
                ;DCD     DefaultISR                          ;221
                ;DCD     DefaultISR                          ;222
                ;DCD     DefaultISR                          ;223
                ;DCD     DefaultISR                          ;224
                ;DCD     DefaultISR                          ;225
                ;DCD     DefaultISR                          ;226
                ;DCD     DefaultISR                          ;227
                ;DCD     DefaultISR                          ;228
                ;DCD     DefaultISR                          ;229
                ;DCD     DefaultISR                          ;230
                ;DCD     DefaultISR                          ;231
                ;DCD     DefaultISR                          ;232
                ;DCD     DefaultISR                          ;233
                ;DCD     DefaultISR                          ;234
                ;DCD     DefaultISR                          ;235
                ;DCD     DefaultISR                          ;236
                ;DCD     DefaultISR                          ;237
                ;DCD     DefaultISR                          ;238
                ;DCD     DefaultISR                          ;239
                ;DCD     DefaultISR                          ;240
                ;DCD     DefaultISR                          ;241
                ;DCD     DefaultISR                          ;242
                ;DCD     DefaultISR                          ;243
                ;DCD     DefaultISR                          ;244
                ;DCD     DefaultISR                          ;245
                ;DCD     DefaultISR                          ;246
                ;DCD     DefaultISR                          ;247
                ;DCD     DefaultISR                          ;248
                ;DCD     DefaultISR                          ;249
                ;DCD     DefaultISR                          ;250
                ;DCD     DefaultISR                          ;251
                ;DCD     DefaultISR                          ;252
                ;DCD     DefaultISR                          ;253
                ;DCD     DefaultISR                          ;254
                ;DCD     DefaultISR                          ;255
;__Vectors_End

