LBH9527/ESLink-II/startup/startup_MK22F12810_v1.3.s
;__Vectors_Size 	EQU     __Vectors_End - __Vectors

;; <h> Flash Configuration
;;   <i> 16-byte flash configuration field that stores default protection settings (loaded on reset)
;;   <i> and security information that allows the MCU to restrict acces to the FTFL module.
;;   <h> Backdoor Comparison Key
;;     <o0>  Backdoor Key 0  <0x0-0xFF:2>
;;     <o1>  Backdoor Key 1  <0x0-0xFF:2>
;;     <o2>  Backdoor Key 2  <0x0-0xFF:2>
;;     <o3>  Backdoor Key 3  <0x0-0xFF:2>
;;     <o4>  Backdoor Key 4  <0x0-0xFF:2>
;;     <o5>  Backdoor Key 5  <0x0-0xFF:2>
;;     <o6>  Backdoor Key 6  <0x0-0xFF:2>
;;     <o7>  Backdoor Key 7  <0x0-0xFF:2>
;BackDoorK0      EQU     0xFF
;BackDoorK1      EQU     0xFF
;BackDoorK2      EQU     0xFF
;BackDoorK3      EQU     0xFF
;BackDoorK4      EQU     0xFF
;BackDoorK5      EQU     0xFF
;BackDoorK6      EQU     0xFF
;BackDoorK7      EQU     0xFF
;;   </h>
;;   <h> Program flash protection bytes (FPROT)
;;     <i> Each program flash region can be protected from program and erase operation by setting the associated PROT bit.
;;     <i> Each bit protects a 1/32 region of the program flash memory.
;;     <h> FPROT0
;;       <i> Program flash protection bytes
;;       <i> 1/32 - 8/32 region
;;       <o.0>   FPROT0.0
;;       <o.1>   FPROT0.1
;;       <o.2>   FPROT0.2
;;       <o.3>   FPROT0.3
;;       <o.4>   FPROT0.4
;;       <o.5>   FPROT0.5
;;       <o.6>   FPROT0.6
;;       <o.7>   FPROT0.7
;nFPROT0         EQU     0x00
;FPROT0          EQU     nFPROT0:EOR:0xFF
;;     </h>
;;     <h> FPROT1
;;       <i> Program Flash Region Protect Register 1
;;       <i> 9/32 - 16/32 region
;;       <o.0>   FPROT1.0
;;       <o.1>   FPROT1.1
;;       <o.2>   FPROT1.2
;;       <o.3>   FPROT1.3
;;       <o.4>   FPROT1.4
;;       <o.5>   FPROT1.5
;;       <o.6>   FPROT1.6
;;       <o.7>   FPROT1.7
;nFPROT1         EQU     0x00
;FPROT1          EQU     nFPROT1:EOR:0xFF
;;     </h>
;;     <h> FPROT2
;;       <i> Program Flash Region Protect Register 2
;;       <i> 17/32 - 24/32 region
;;       <o.0>   FPROT2.0
;;       <o.1>   FPROT2.1
;;       <o.2>   FPROT2.2
;;       <o.3>   FPROT2.3
;;       <o.4>   FPROT2.4
;;       <o.5>   FPROT2.5
;;       <o.6>   FPROT2.6
;;       <o.7>   FPROT2.7
;nFPROT2         EQU     0x00
;FPROT2          EQU     nFPROT2:EOR:0xFF
;;     </h>
;;     <h> FPROT3
;;       <i> Program Flash Region Protect Register 3
;;       <i> 25/32 - 32/32 region
;;       <o.0>   FPROT3.0
;;       <o.1>   FPROT3.1
;;       <o.2>   FPROT3.2
;;       <o.3>   FPROT3.3
;;       <o.4>   FPROT3.4
;;       <o.5>   FPROT3.5
;;       <o.6>   FPROT3.6
;;       <o.7>   FPROT3.7
;nFPROT3         EQU     0x00
;FPROT3          EQU     nFPROT3:EOR:0xFF
;;     </h>
;;   </h>
;;   <h> Data flash protection byte (FDPROT)
;;     <i> Each bit protects a 1/8 region of the data flash memory.
;;     <i> (Program flash only devices: Reserved)
;;     <o.0>   FDPROT.0
;;     <o.1>   FDPROT.1
;;     <o.2>   FDPROT.2
;;     <o.3>   FDPROT.3
;;     <o.4>   FDPROT.4
;;     <o.5>   FDPROT.5
;;     <o.6>   FDPROT.6
;;     <o.7>   FDPROT.7
;nFDPROT         EQU     0x00
;FDPROT          EQU     nFDPROT:EOR:0xFF
;;   </h>
;;   <h> EEPROM protection byte (FEPROT)
;;     <i> FlexNVM devices: Each bit protects a 1/8 region of the EEPROM.
;;     <i> (Program flash only devices: Reserved)
;;     <o.0>   FEPROT.0
;;     <o.1>   FEPROT.1
;;     <o.2>   FEPROT.2
;;     <o.3>   FEPROT.3
;;     <o.4>   FEPROT.4
;;     <o.5>   FEPROT.5
;;     <o.6>   FEPROT.6
;;     <o.7>   FEPROT.7
;nFEPROT         EQU     0x00
;FEPROT          EQU     nFEPROT:EOR:0xFF
;;   </h>
;;   <h> Flash nonvolatile option byte (FOPT)
;;     <i> Allows the user to customize the operation of the MCU at boot time.
;;     <o.0>  LPBOOT
;;       <0=> Low-power boot
;;       <1=> normal boot
;;     <o.1>  EZPORT_DIS
;;       <0=> EzPort operation is enabled
;;       <1=> EzPort operation is disabled
;FOPT            EQU     0xFF
;;   </h>
;;   <h> Flash security byte (FSEC)
;;     <i> WARNING: If SEC field is configured as "MCU security status is secure" and MEEN field is configured as "Mass erase is disabled",
;;     <i> MCU's security status cannot be set back to unsecure state since Mass erase via the debugger is blocked !!!
;;     <o.0..1> SEC
;;       <2=> MCU security status is unsecure
;;       <3=> MCU security status is secure
;;         <i> Flash Security
;;         <i> This bits define the security state of the MCU.
;;     <o.2..3> FSLACC
;;       <2=> Freescale factory access denied
;;       <3=> Freescale factory access granted
;;         <i> Freescale Failure Analysis Access Code
;;         <i> This bits define the security state of the MCU.
;;     <o.4..5> MEEN
;;       <2=> Mass erase is disabled
;;       <3=> Mass erase is enabled
;;         <i> Mass Erase Enable Bits
;;         <i> Enables and disables mass erase capability of the FTFL module
;;     <o.6..7> KEYEN
;;       <2=> Backdoor key access enabled
;;       <3=> Backdoor key access disabled
;;         <i> Backdoor key Security Enable
;;         <i> These bits enable and disable backdoor key access to the FTFL module.
;FSEC            EQU     0xFE
;;   </h>
;; </h>
                ;IF      :LNOT::DEF:RAM_TARGET
                ;AREA    |.ARM.__at_0x400|, CODE, READONLY
                ;DCB     BackDoorK0, BackDoorK1, BackDoorK2, BackDoorK3
                ;DCB     BackDoorK4, BackDoorK5, BackDoorK6, BackDoorK7
                ;DCB     FPROT0,     FPROT1,     FPROT2,     FPROT3
                ;DCB     FSEC,       FOPT,       FEPROT,     FDPROT
                ;ENDIF

;_NVIC_ICER0     EQU   0xE000E180
;_NVIC_ICPR0     EQU   0xE000E280

                ;AREA    |.text|, CODE, READONLY

;; Reset Handler

;Reset_Handler   PROC
                ;EXPORT  Reset_Handler             [WEAK]
                ;IMPORT  SystemInit
                ;IMPORT  __main

                ;CPSID   I               ; Mask interrupts
                ;LDR R0, =_NVIC_ICER0    ; Disable interrupts and clear pending flags
                ;LDR R1, =_NVIC_ICPR0
                ;LDR R2, =0xFFFFFFFF
                ;MOV R3, #8
;_irq_clear
                ;CBZ R3, _irq_clear_end
                ;STR R2, [R0], #4        ; NVIC_ICERx - clear enable IRQ register
                ;STR R2, [R1], #4        ; NVIC_ICPRx - clear pending IRQ register
                ;SUB R3, R3, #1
                ;B _irq_clear
;_irq_clear_end
                ;LDR     R0, =SystemInit
                ;BLX     R0
                ;CPSIE   i               ; Unmask interrupts
                ;LDR     R0, =__main
                ;BX      R0
                ;ENDP


;; Dummy Exception Handlers (infinite loops which can be modified)
;NMI_Handler\
                ;PROC
                ;EXPORT  NMI_Handler         [WEAK]
                ;B       .
                ;ENDP
;HardFault_Handler\
                ;PROC
                ;EXPORT  HardFault_Handler         [WEAK]
                ;B       .
                ;ENDP
;MemManage_Handler\
                ;PROC
                ;EXPORT  MemManage_Handler         [WEAK]
                ;B       .
                ;ENDP
;BusFault_Handler\
                ;PROC
                ;EXPORT  BusFault_Handler         [WEAK]
                ;B       .
                ;ENDP
;UsageFault_Handler\
                ;PROC
                ;EXPORT  UsageFault_Handler         [WEAK]
                ;B       .
                ;ENDP
;SVC_Handler\
                ;PROC
                ;EXPORT  SVC_Handler         [WEAK]
                ;B       .
                ;ENDP
;DebugMon_Handler\
                ;PROC
                ;EXPORT  DebugMon_Handler         [WEAK]
                ;B       .
                ;ENDP
;PendSV_Handler\
                ;PROC
                ;EXPORT  PendSV_Handler         [WEAK]
                ;B       .
                ;ENDP
;SysTick_Handler\
                ;PROC
                ;EXPORT  SysTick_Handler         [WEAK]
                ;B       .
                ;ENDP
;Default_Handler\
                ;PROC
                ;EXPORT  DMA0_IRQHandler         [WEAK]
                ;EXPORT  DMA1_IRQHandler         [WEAK]
                ;EXPORT  DMA2_IRQHandler         [WEAK]
                ;EXPORT  DMA3_IRQHandler         [WEAK]
                ;EXPORT  Reserved20_IRQHandler         [WEAK]
                ;EXPORT  Reserved21_IRQHandler         [WEAK]
                ;EXPORT  Reserved22_IRQHandler         [WEAK]
                ;EXPORT  Reserved23_IRQHandler         [WEAK]
                ;EXPORT  Reserved24_IRQHandler         [WEAK]
                ;EXPORT  Reserved25_IRQHandler         [WEAK]
                ;EXPORT  Reserved26_IRQHandler         [WEAK]
                ;EXPORT  Reserved27_IRQHandler         [WEAK]
                ;EXPORT  Reserved28_IRQHandler         [WEAK]
                ;EXPORT  Reserved29_IRQHandler         [WEAK]
                ;EXPORT  Reserved30_IRQHandler         [WEAK]
                ;EXPORT  Reserved31_IRQHandler         [WEAK]
                ;EXPORT  DMA_Error_IRQHandler         [WEAK]
                ;EXPORT  MCM_IRQHandler         [WEAK]
                ;EXPORT  FTF_IRQHandler         [WEAK]
                ;EXPORT  Read_Collision_IRQHandler         [WEAK]
                ;EXPORT  LVD_LVW_IRQHandler         [WEAK]
                ;EXPORT  LLW_IRQHandler         [WEAK]
                ;EXPORT  Watchdog_IRQHandler         [WEAK]
                ;EXPORT  Reserved39_IRQHandler         [WEAK]
                ;EXPORT  I2C0_IRQHandler         [WEAK]
                ;EXPORT  I2C1_IRQHandler         [WEAK]
                ;EXPORT  SPI0_IRQHandler         [WEAK]
                ;EXPORT  SPI1_IRQHandler         [WEAK]
                ;EXPORT  I2S0_Tx_IRQHandler         [WEAK]
                ;EXPORT  I2S0_Rx_IRQHandler         [WEAK]
                ;EXPORT  LPUART0_IRQHandler         [WEAK]
                ;EXPORT  UART0_RX_TX_IRQHandler         [WEAK]
                ;EXPORT  UART0_ERR_IRQHandler         [WEAK]
                ;EXPORT  UART1_RX_TX_IRQHandler         [WEAK]
                ;EXPORT  UART1_ERR_IRQHandler         [WEAK]
                ;EXPORT  UART2_RX_TX_IRQHandler         [WEAK]
                ;EXPORT  UART2_ERR_IRQHandler         [WEAK]
                ;EXPORT  Reserved53_IRQHandler         [WEAK]
                ;EXPORT  Reserved54_IRQHandler         [WEAK]
                ;EXPORT  ADC0_IRQHandler         [WEAK]
                ;EXPORT  CMP0_IRQHandler         [WEAK]
                ;EXPORT  CMP1_IRQHandler         [WEAK]
                ;EXPORT  FTM0_IRQHandler         [WEAK]
                ;EXPORT  FTM1_IRQHandler         [WEAK]
                ;EXPORT  FTM2_IRQHandler         [WEAK]
                ;EXPORT  Reserved61_IRQHandler         [WEAK]
                ;EXPORT  RTC_IRQHandler         [WEAK]
                ;EXPORT  RTC_Seconds_IRQHandler         [WEAK]
                ;EXPORT  PIT0_IRQHandler         [WEAK]
                ;EXPORT  PIT1_IRQHandler         [WEAK]
                ;EXPORT  PIT2_IRQHandler         [WEAK]
                ;EXPORT  PIT3_IRQHandler         [WEAK]
                ;EXPORT  PDB0_IRQHandler         [WEAK]
                ;EXPORT  USB0_IRQHandler         [WEAK]
                ;EXPORT  Reserved70_IRQHandler         [WEAK]
                ;EXPORT  Reserved71_IRQHandler         [WEAK]
                ;EXPORT  DAC0_IRQHandler         [WEAK]
                ;EXPORT  MCG_IRQHandler         [WEAK]
                ;EXPORT  LPTimer_IRQHandler         [WEAK]
                ;EXPORT  PORTA_IRQHandler         [WEAK]
                ;EXPORT  PORTB_IRQHandler         [WEAK]
                ;EXPORT  PORTC_IRQHandler         [WEAK]
                ;EXPORT  PORTD_IRQHandler         [WEAK]
                ;EXPORT  PORTE_IRQHandler         [WEAK]
                ;EXPORT  SWI_IRQHandler         [WEAK]
                ;EXPORT  Reserved81_IRQHandler         [WEAK]
                ;EXPORT  Reserved82_IRQHandler         [WEAK]
                ;EXPORT  Reserved83_IRQHandler         [WEAK]
                ;EXPORT  Reserved84_IRQHandler         [WEAK]
                ;EXPORT  Reserved85_IRQHandler         [WEAK]
                ;EXPORT  Reserved86_IRQHandler         [WEAK]
                ;EXPORT  Reserved87_IRQHandler         [WEAK]
                ;EXPORT  Reserved88_IRQHandler         [WEAK]
                ;EXPORT  ADC1_IRQHandler         [WEAK]
                ;EXPORT  Reserved90_IRQHandler         [WEAK]
                ;EXPORT  Reserved91_IRQHandler         [WEAK]
                ;EXPORT  Reserved92_IRQHandler         [WEAK]
                ;EXPORT  Reserved93_IRQHandler         [WEAK]
                ;EXPORT  Reserved94_IRQHandler         [WEAK]
                ;EXPORT  Reserved95_IRQHandler         [WEAK]
                ;EXPORT  Reserved96_IRQHandler         [WEAK]
                ;EXPORT  Reserved97_IRQHandler         [WEAK]
                ;EXPORT  Reserved98_IRQHandler         [WEAK]
                ;EXPORT  Reserved99_IRQHandler         [WEAK]
                ;EXPORT  Reserved100_IRQHandler         [WEAK]
                ;EXPORT  Reserved101_IRQHandler         [WEAK]
                ;EXPORT  DefaultISR         [WEAK]
;DMA0_IRQHandler
;DMA1_IRQHandler
;DMA2_IRQHandler
;DMA3_IRQHandler
;Reserved20_IRQHandler
;Reserved21_IRQHandler
;Reserved22_IRQHandler
;Reserved23_IRQHandler
;Reserved24_IRQHandler
;Reserved25_IRQHandler
;Reserved26_IRQHandler
;Reserved27_IRQHandler
;Reserved28_IRQHandler
;Reserved29_IRQHandler
;Reserved30_IRQHandler
;Reserved31_IRQHandler
;DMA_Error_IRQHandler
;MCM_IRQHandler
;FTF_IRQHandler
;Read_Collision_IRQHandler
;LVD_LVW_IRQHandler
;LLW_IRQHandler
;Watchdog_IRQHandler
;Reserved39_IRQHandler
;I2C0_IRQHandler
;I2C1_IRQHandler
;SPI0_IRQHandler
;SPI1_IRQHandler
;I2S0_Tx_IRQHandler
;I2S0_Rx_IRQHandler
;LPUART0_IRQHandler
;UART0_RX_TX_IRQHandler
;UART0_ERR_IRQHandler
;UART1_RX_TX_IRQHandler
;UART1_ERR_IRQHandler
;UART2_RX_TX_IRQHandler
;UART2_ERR_IRQHandler
;Reserved53_IRQHandler
;Reserved54_IRQHandler
;ADC0_IRQHandler
;CMP0_IRQHandler
;CMP1_IRQHandler
;FTM0_IRQHandler
;FTM1_IRQHandler
;FTM2_IRQHandler
;Reserved61_IRQHandler
;RTC_IRQHandler
;RTC_Seconds_IRQHandler
;PIT0_IRQHandler
;PIT1_IRQHandler
;PIT2_IRQHandler
;PIT3_IRQHandler
;PDB0_IRQHandler
;USB0_IRQHandler
;Reserved70_IRQHandler
;Reserved71_IRQHandler
;DAC0_IRQHandler
;MCG_IRQHandler
;LPTimer_IRQHandler
;PORTA_IRQHandler
;PORTB_IRQHandler
;PORTC_IRQHandler
;PORTD_IRQHandler
;PORTE_IRQHandler
;SWI_IRQHandler
;Reserved81_IRQHandler
;Reserved82_IRQHandler
;Reserved83_IRQHandler
;Reserved84_IRQHandler
;Reserved85_IRQHandler
;Reserved86_IRQHandler
;Reserved87_IRQHandler
;Reserved88_IRQHandler
;ADC1_IRQHandler
;Reserved90_IRQHandler
;Reserved91_IRQHandler
;Reserved92_IRQHandler
;Reserved93_IRQHandler
;Reserved94_IRQHandler
;Reserved95_IRQHandler
;Reserved96_IRQHandler
;Reserved97_IRQHandler
;Reserved98_IRQHandler
;Reserved99_IRQHandler
;Reserved100_IRQHandler
;Reserved101_IRQHandler
;DefaultISR
                ;B       .
                ;ENDP
                  ;ALIGN


;; User Initial Stack & Heap

                ;IF      :DEF:__MICROLIB

                ;EXPORT  __initial_sp
                ;EXPORT  __heap_base
                ;EXPORT  __heap_limit

                ;ELSE

                ;IMPORT  __use_two_region_memory
                ;EXPORT  __user_initial_stackheap
;__user_initial_stackheap

